# CreateRadioButton2

## Description
Create a radio button with icon.

```pascal
PROCEDURE CreateRadioButton2(
				dialogID    : LONGINT;
				itemID      : LONGINT;
				text        : DYNARRAY[] of CHAR;
				iconResPath : DYNARRAY[] of CHAR);
```

```python
def vs.CreateRadioButton2(dialogID, itemID, text, iconResPath):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|dialogID|LONGINT|The ID of the dialog.|
|itemID|LONGINT|The ID of the control.|
|text|DYNARRAY[] of CHAR|The text of the control.|
|iconResPath|DYNARRAY[] of CHAR|The resource path of the icon.|

## Version
Availability: from Vectorworks 2023

## Category
* Dialogs - Modern